openfoam9/tutorials/multiphase/multiphaseEulerFoam/laminar/steamInjection/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitp
{
    type       limitPressure;

    min        1e4;
}

limitTsteam
{
    type            limitTemperature;
    selectionMode   all;
    min             270;
    max             2000;
    phase           steam;
}

limitTwater
{
    type            limitTemperature;
    selectionMode   all;
    min             270;
    max             2000;
    phase           water;
}

// ************************************************************************* //
